eisup_2019_docmng_integration/src/BusinessProcesses/абс_СогласованиеТЭО/абс_СогласованиеТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абс_СогласованиеТЭО</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/Enums/абс_ВидТЭО/абс_ВидТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидТЭО</name>
  <enumValues>
    <name>ТЭО</name>
  </enumValues>
  <enumValues>
    <name>ЭкспрессТЭО</name>
  </enumValues>
  <enumValues>
    <name>БюджетнаяОценка</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусСогласованияТЭО/абс_СтатусСогласованияТЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусСогласованияТЭО</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИТРТЭО</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеИК</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИТРДП</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтработан</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыОС/абс_СтатусыОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОС</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЗО</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеКТТК</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ГруппыОС/ГруппыОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыОС</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Здания</name>
  </enumValues>
  <enumValues>
    <name>Сооружения</name>
  </enumValues>
  <enumValues>
    <name>абс_СооруженияНедвижимость</name>
  </enumValues>
  <enumValues>
    <name>МашиныИОборудование</name>
  </enumValues>
  <enumValues>
    <name>ОфисноеОборудование</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеСредства</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйИХозяйственныйИнвентарь</name>
  </enumValues>
  <enumValues>
    <name>РабочийСкот</name>
  </enumValues>
  <enumValues>
    <name>ПродуктивныйСкот</name>
  </enumValues>
  <enumValues>
    <name>МноголетниеНасаждения</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныеУчастки</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыПриродопользования</name>
  </enumValues>
  <enumValues>
    <name>ДругиеВидыОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>КапитальныеВложенияВАрендованноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>ВычислительнаяТехника</name>
  </enumValues>
  <enumValues>
    <name>ПрочееИмуществоТребующееГосударственнойРегистрации</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/BusinessProcesses/абс_СогласованиеТЭО/ObjectModule.bsl
Процедура ЭкспрессТЭОПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.ВидТЭО = Перечисления.абс_ВидТЭО.ЭкспрессТЭО или ТЭО.Актуализация  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ДействияПослеПодготовкиОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусТЭО = ТЭО.Статус;
	
	Если ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.РазработкаИТРТЭО Тогда
		Результат = ТочкаВыбораВарианта.Варианты.РазработкаИТРТЭО;
	ИначеЕсли  ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.ЗапросИнформации;
	ИначеЕсли ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;
	КонецЕсли;
КонецПроцедуры

Процедура СогласованоИТРПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ЭтоЭкспрессТЭО2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.ВидТЭО = Перечисления.абс_ВидТЭО.ЭкспрессТЭО или ТЭО.Актуализация Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ДействияПослеПодготовкиЭкспрессОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ТекСтатусТЭО = ТЭО.Статус;
	
	Если ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.СогласованиеДЭФ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.СогласованиеДЭФ;
	ИначеЕсли  ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.ЗапросИнформации Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.ЗапросИнформации;
	ИначеЕсли ТекСтатусТЭО = Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда	
		Результат = ТочкаВыбораВарианта.Варианты.Отказ;
	КонецЕсли;
	
КонецПроцедуры

Процедура СогласованРазработкаИТРДППроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура ПодготовкаЗаявкиПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ДействиеПриОтказеПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)

КонецПроцедуры

Процедура РазработкаИТРТЭОПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.РазработкаИТРТЭО,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура СогласованиеИКПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СогласованиеИК,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ЗапросИнформацииПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ЗапросОработанПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура РазработкаИТРДППередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.РазработкаИТРДП,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура СогласованИКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		Результат	= Истина;
	Иначе
		Результат	= Ложь;
	КонецЕсли;	
КонецПроцедуры

Процедура СогласованоДЭФПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ТЭО.Статус <> Перечисления.абс_СтатусСогласованияТЭО.Отказ  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
КонецПроцедуры

Процедура СогласованиеДЭФПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.СогласованиеДЭИ,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура СформироватьЗадачуНаСогласование(Роль,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи)
	
	ФормируемыеЗадачи.Очистить();
	
	Если ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ПодготовкаТЭО или ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросИнформации или ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросОработан Тогда
		НоваяЗадача 					= Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
		НоваяЗадача.Дата 				= ТекущаяДата();
		НоваяЗадача.Наименование 		= Строка(ЭтотОбъект.Ссылка.ТЭО) + " " + ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
		
		Если ТочкаМаршрутаБизнесПроцесса    = БизнесПроцессы.абс_СогласованиеТЭО.ТочкиМаршрута.ЗапросИнформации Тогда
			
			МассивПользователей = абс_БизнесПроцессы.ПолучитьПользователяПоСотруднику(ТЭО.СотрудникДопСогласование);
			Если МассивПользователей.Количество() > 0 Тогда
				НоваяЗадача.Исполнитель = МассивПользователей[0];
			КонецЕсли;

		Иначе	
			НоваяЗадача.Исполнитель 		= ПользовательИнициаторБП;
		КонецЕсли;
		
		НоваяЗадача.Роль 			    = Роль;
		НоваяЗадача.Организация 		= абс_БизнесПроцессыУведомления.ПолучитьОрганизациюСотрудника(ПользовательИнициаторБП);
		НоваяЗадача.ОбъектЗадачи 		= ТЭО;
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИИсполнители.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
		|ГДЕ
		|	РолиИИсполнители.Роль = &Роль
		|	И РолиИИсполнители.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Роль", Роль);
		Запрос.УстановитьПараметр("Организация", абс_БизнесПроцессыУведомления.ПолучитьОрганизациюСотрудника(ПользовательИнициаторБП));

		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
			НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
			НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
			НоваяЗадача.Дата 				= ТекущаяДата();
			НоваяЗадача.Наименование 		= Строка(ЭтотОбъект.Ссылка.ТЭО) + " " + ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
			НоваяЗадача.Роль 			    = Роль;
			НоваяЗадача.Организация 		= абс_БизнесПроцессыУведомления.ПолучитьОрганизациюСотрудника(ПользовательИнициаторБП);
			НоваяЗадача.ОбъектЗадачи 		= ТЭО.Ссылка;
			
			НоваяЗадача.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
			ФормируемыеЗадачи.Добавить(НоваяЗадача);
		КонецЦикла;
	КонецЕсли;
	
	// Добавим задачи для суперпользователей
	//абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, ЗаявкаНаДобавлениеПрав.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	//абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, ЗаявкаНаДобавлениеПрав.Статус);	
 КонецПроцедуры
 
 Процедура Условие4ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС <> Перечисления.абс_СтатусыОС.Отмена  Тогда
		 Результат	= Истина;
	 Иначе
		 Результат	= Ложь;
	 КонецЕсли;	
 КонецПроцедуры

 Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Результат = абс_БизнесПроцессыУведомления.ПолучитьСтатусОрганизацииСотрудника(ОсновноеСредство);
 КонецПроцедуры
 
Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	ПрочиеОС = Ложь;
	МассивГруппОСНеПрочие =  Новый Массив;
	МассивГруппОСНеПрочие.Добавить(Перечисления.ГруппыОС.ТранспортныеСредства);
	МассивГруппОСНеПрочие.Добавить(Перечисления.ГруппыОС.Здания);
	МассивГруппОСНеПрочие.Добавить(Перечисления.ГруппыОС.ЗемельныеУчастки);
	
	Если МассивГруппОСНеПрочие.Найти(ОсновноеСредство.ГруппаОС) = Неопределено Тогда
		ПрочиеОС = Истина;
	КонецЕсли;

	Результат = ПрочиеОС;
	
КонецПроцедуры

Процедура Условие3ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура Условие5ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отмена  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура Условие7ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура Условие6ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура ВыборВарианта1ОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ Тогда
		Результат	  = ТочкаВыбораВарианта.Варианты.Отказ;
	ИначеЕсли ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Корректировка Тогда
		Результат	  = ТочкаВыбораВарианта.Варианты.Корректировка;
	ИначеЕсли ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Закрыт Тогда	
		Результат     = ТочкаВыбораВарианта.Варианты.Закрыт;
	КонецЕсли;
	
КонецПроцедуры

Процедура Условие8ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СогласованиеНаУровнеДЗОПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.ОтветственныйОСДЗО,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура Действие1ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.ОтветственныйОСКТТК,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура ПолготовкаПрошлаУспешноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	 Если ОсновноеСредство.абс_СтатусОС = Перечисления.абс_СтатусыОС.Отказ  Тогда
		 Результат	= Ложь;
	 Иначе
		 Результат	= Истина;
	 КонецЕсли;	
КонецПроцедуры

Процедура ДействияПослеСогласованияПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.Бухгалтерия,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры

Процедура КорректировкаОСПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 СформироватьЗадачуНаСогласование(Справочники.РолиИсполнителей.ИнициаторОС,ТочкаМаршрутаБизнесПроцесса,ФормируемыеЗадачи);
КонецПроцедуры
